Tekla Open API Reference for Tekla Structures 2025
PropertyElement.PropertyType Property
 The type of the property element.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PropertyElement.PropertyElementType PropertyType { get; }
Public ReadOnly Property PropertyType As PropertyElement.PropertyElementType
	Get
Property Value
Type: PropertyElement.PropertyElementType
See Also
Reference
PropertyElement Class
Tekla.Structures.Drawing Namespace